Repository: BrianNguyen1507/MovieBookingApps
Catalog: App/movie_booking_app/lib/l10n/app_*.arb
Languages: vi

source: Cinema
vi: Rạp phim

source: Store
vi: Cửa hàng

source: Personal
vi: Tôi

# voucher
source: Vouchers
vi: Ưu đãi

source: Now Showing
vi: Phim đang chiếu

# comming
source: Comming Soon
vi: Phim sắp chiếu

source: Version
vi: Phiên bản

source: Password
vi: Mật khẩu

source: Repassword
vi: Xác nhận mật khẩu

source: Full Name
vi: Họ và tên

# phone
source: Phone number
vi: Số điện thoại

source: Gender
vi: Giới tính

# ahac
source: Already have an Account?
vi: Bạn đã có tài khoản?

# dhac
source: Don't have an Account?
vi: Chưa có tài khoản?

# send
source: Sign in
vi: Đăng nhập

source: SUBMIT
vi: Đăng ký

source: Male
vi: Nam

source: Female
vi: Nữ

# dob
source: Date of Birth
vi: Ngày sinh

# sin
source: SIGN IN
vi: ĐĂNG NHẬP

# sup
source: SIGN UP
vi: ĐĂNG KÝ

# fnd
source: Food and drinks
vi: Thức ăn và nước uống

source: Price
vi: Giá

source: Buy
vi: Mua

source: Log out
vi: ĐĂNG XUẤT

# watched
source: Movie tickets
vi: Vé xem phim

# revw
source: Reviews
vi: Lượt đánh giá

# termhead
source: Terms and Conditions
vi: Điều Khoản và Điều Kiện

# line1
source: 1. Purpose of Use:
vi: 1. Mục Đích Sử Dụng:

# line2
source: - The application is provided to help users book movie tickets easily and conveniently.
vi: - Ứng dụng được cung cấp để giúp người dùng đặt vé xem phim một cách dễ dàng và thuận tiện.

# line3
source: - Users are only allowed to use the application for personal and non-commercial purposes.
vi: - Người dùng chỉ được phép sử dụng ứng dụng cho mục đích cá nhân và không thương mại.

# line4
source: 2. User Rights and Responsibilities:
vi: 2. Quyền và Trách Nhiệm của Người Dùng:

# line5
source: - Users are responsible for providing accurate and complete information when creating an account and using the application.
vi: - Người dùng có trách nhiệm cung cấp thông tin chính xác và đầy đủ khi tạo tài khoản và sử dụng ứng dụng.

# line6
source: - Users are responsible for keeping their account passwords and payment information confidential.
vi: - Người dùng có trách nhiệm bảo mật mật khẩu tài khoản và thông tin thanh toán của họ.

# line7
source: - Users are not allowed to use the application for any illegal or unethical purposes.
vi: - Người dùng không được phép sử dụng ứng dụng cho bất kỳ mục đích bất hợp pháp hoặc không đạo đức nào.

# line8
source: - Users are responsible for compensating damages to the application and third parties caused by their violation of the terms.
vi: - Người dùng có trách nhiệm bồi thường thiệt hại cho ứng dụng và các bên thứ ba do vi phạm các điều khoản.

# line9
source: 3. Service Provider Rights and Responsibilities:
vi: 3. Quyền và Trách Nhiệm của Nhà Cung Cấp Dịch Vụ:

# line10
source: - The service provider has the right to change the terms of use at any time.
vi: - Nhà cung cấp dịch vụ có quyền thay đổi các điều khoản sử dụng bất kỳ lúc nào.

# line11
source: - The service provider has the right to suspend or terminate user accounts if they violate the terms.
vi: - Nhà cung cấp dịch vụ có quyền tạm ngưng hoặc chấm dứt tài khoản người dùng nếu họ vi phạm các điều khoản.

# line12
source: - The service provider has the right to collect and use user personal data in accordance with the law.
vi: - Nhà cung cấp dịch vụ có quyền thu thập và sử dụng dữ liệu cá nhân của người dùng theo quy định của pháp luật.

# line13
source: - The service provider is responsible for securing user personal information.
vi: - Nhà cung cấp dịch vụ có trách nhiệm bảo mật thông tin cá nhân của người dùng.

# seeAll
source: ALL
vi: Tất cả

# classify_K
source: The movie is available for viewers under 13 years old with a guardian
vi: Phim dành cho người xem dưới 13 tuổi có người giám hộ

# classify_P
source: The movie is available for viewers of all ages
vi: Phim có sẵn cho người xem ở mọi lứa tuổi

# classify_C
source: The movie is not allowed to be shown
vi: Phim không được phép chiếu

# classify_T13
source: The movie is available for viewers aged 13 and above
vi: Phim dành cho người xem từ 13 tuổi trở lên

# classify_T16
source: The movie is available for viewers aged 16 and above
vi: Phim dành cho người xem từ 16 tuổi trở lên

# classify_T18
source: The movie is available for viewers aged 18 and above
vi: Phim dành cho người xem từ 18 tuổi trở lên

source: show more
vi: Hiển thị nhiều hơn

source: show less
vi: Hiển thị ít hơn

source: Country
vi: Quốc gia

source: Release date
vi: Ngày phát hành

source: Duration
vi: Thời lượng

source: Language
vi: Ngôn ngữ

source: minutes
vi: phút

source: Description
vi: Mô tả

# director
source: Directors
vi: Đạo diễn

# actor
source: actors
vi: Diễn viên

source: Rating & feedback
vi: Đánh giá & Phản hồi

source: Feedback
vi: Phản hồi

# rating_0
source: Invalid rating
vi: Không xác định

# rating_1
source: Not good
vi: Phim không hay lắm!

# rating_2
source: Not very satisfied
vi: Phim chưa được hài lòng!

# rating_3
source: Okay movie
vi: Phim tạm ổn!

# rating_4
source: Very good
vi: Phim rất hay!

# rating_5
source: Excellent movie
vi: Phim suất sắc!

source: Movie Detail
vi: Thông tin chi tiết phim

# commented
source: Commented at
vi: Đã phản hồi vào lúc

# branch_cinema
source: Cinema branch
vi: Chi nhánh rạp chiếu

source: Booking
vi: Đặt vé ngay

# tieptuc
source: Continue
vi: Tiếp tục

# error_schedule
source: Oops! There are no schedules available
vi: Ơ! Hiện tại chưa có suất chiếu.

# error_schedule_bonus
source: Please try finding another date.
vi: Bạn hãy thử tìm ngày khác nhé.

source: S C R E E N
vi: M À N H Ì N H

# seat_available
source: Available
vi: Ghế trống

# seat_selected
source: Selected
vi: Ghế bạn chọn

# seat_pending
source: Pending
vi: Ghế đang chờ

# seat_sold
source: Sold
vi: Ghế đã đặt

# seat_disable
source: Disable
vi: Ghế bị tắt

source: Theater
vi: Rạp

source: Room
vi: Phòng chiếu

source: Show time
vi: Giờ chiếu

# seats
source: Seat
vi: Số ghế

source: Total
vi: Giá tiền

source: Sum total
vi: Tổng tiền

# order_inf
source: Order information
vi: Thông tin đặt vé

# order_detail
source: Order Details
vi: Chi tiết đặt vé

source: My vouchers
vi: Ưu đãi của tôi

# cus_inf
source: Custom information
vi: Thông tin khách hàng

source: Discount
vi: Giảm giá

# open
source: PAYMENT VIA
vi: THANH TOÁN VỚI

# pay_inf
source: Payment infomation
vi: Thông tin thanh toán

# pay_method
source: Payment method
vi: Phương thức thanh toán

# selectionDetail
source: Selection Details
vi: Thông tin suất chiếu

# personal_inf
source: Personal infomation
vi: Thông tin cá nhân

# my_orders
source: My ticket list
vi: Vé của tôi

# category
source: Categories
vi: Thể loại

# update_info
source: Update Infomation
vi: Cập nhật thông tin

# change_pass
source: Change password
vi: Đổi mật khẩu

source: Date Order
vi: Ngày thanh toán

# payment_med
source: Payment
vi: Thanh toán

source: Payment code
vi: Mã thanh toán

# note1
source: Show this code to the staff to get tickets
vi: Đưa mã này cho nhân viên rạp chiếu để nhận vé

# note2
source: Thank you for purchasing tickets on our app
vi: Cảm ơn bạn đã mua vé tại ứng dụng của chúng tôi

source: Movie tickets
vi: Vé xem phim

# food_tickets
source: Store tickets
vi: Vé cửa hàng

source: Expired
vi: Quá hạn

source: Unuse
vi: Chưa sử dụng

source: Used
vi: Đã sử dụng

# ticket_quan
source: Quantity
vi: Số vé

# detail_order
source: Order detail
vi: Thông tin vé đã mua

source: Condition
vi: Điều kiện

# date_expired
source: Expired date
vi: Ngày hết hạn

source: Apply
vi: Áp dụng

source: Search
vi: Tìm kiếm

source: Search movie
vi: Tìm kiếm phim

source: Update
vi: Cập nhật

# new_pass
source: New password
vi: Mật khẩu mới

# re_pass
source: Re-enter new password
vi: Nhập lại mật khẩu mới

# movie_by_month
source: Upcoming Movies by Month
vi: Phim hay theo tháng

source: Month
vi: Tháng

# no_voucher
source: Oops! You don't have any vouchers. Please come back later
vi: Ơ!, Bạn chưa có ưu đãi nào. Vui lòng quay lại sau

source: Cancel
vi: Đóng

# no_food
source: No food ordered
vi: Không có thức ăn và nước uống

# date_showtime
source: Movie show date
vi: Ngày chiếu

# pay_success
source: Payment success
vi: Thanh toán thành công

# dialog_alert
source: Notification
vi: Thông báo

# time_end_noti
source: The time order is ended. Please try again!
vi: Ơ! Thời gian đặt vé đã kết thúc. Vui lòng thử lại!

# voucher_noti
source: Please select voucher to continue
vi: Vui lòng chọn phiếu giảm giá để tiếp tục

# payfail_noti
source: Payment Fail
vi: Thanh toán không thành công

# login_expired
source: Your session has timed out, please sign in again!
vi: Phiên của bạn đã hết hạn, vui lòng đăng nhập lại!

# cofirm_logout_q
source: Are you sure to log out?
vi: Bạn có chắc chắn muốn đăng xuất không?

# confirm_logout
source: Yes, log out
vi: Có, đăng xuất

# seat_noti
source: Please select at least one seat before continuing to booking
vi: Vui lòng chọn ít nhất một chỗ ngồi trước khi tiếp tục đặt chỗ

# sigin_noti
source: You need to sign in to continue
vi: Bạn cần đăng nhập để tiếp tục

# go_signin
source: Sign in
vi: Đăng nhập

# find_cinema
source: Do you want to find your way to the cinema?
vi: Bạn có muốn tìm đường đến rạp chiếu phim không?

# food_noti
source: Please choose at least one type of food and drink
vi: Vui lòng chọn ít nhất một loại đồ ăn và đồ uống trước khi tiếp tục

# logout_noti
source: Continue Sign in or Sign up
vi: Tiếp tục đăng nhập hoặc đăng ký

source: Voucher Detail
vi: Chi tiết ưu đãi

# hold_message
source: We are holding your seats
vi: Chúng tôi đang giữ ghế cho bạn

# warning_seat
source: You can only book 10 seats at a time. If you want to book more, please visit the cinema for assistance.
vi: Bạn chỉ được đặt tối đa 10 ghế trong 1 lần Nếu muốn đặt nhiều hơn xin vui lòng đến rạp để được hỗ trợ!

# invalid_seat
source: Some seats have been selected by others, please choose another seat
vi: Một số chỗ ngồi đã có người khác chọn, vui lòng chọn chỗ ngồi khác

source: Time
vi: Thời gian

# pay_notfound
source: Payment failed Please install ZALOPAY app to complete payment
vi: Thanh toán thất bại Vui lòng cài đặt ứng dụng ZALOPAY để hoàn tất thanh toán

# code_8888
source: Object Null
vi: Đối tượng rỗng

# code_9999
source: Uncategorized error
vi: Lỗi không phân loại

# code_1001
source: Invalid key
vi: Khóa không hợp lệ

# code_1002
source: You do not have permission
vi: Bạn không có quyền

# code_1003
source: Email invalid111
vi: Email không hợp lệ

# code_1004
source: Email already exists
vi: Email đã tồn tại

# code_1005
source: Phone Number invalid
vi: Số điện thoại không hợp lệ

# code_1006
source: Day of birth invalid
vi: Ngày sinh không hợp lệ

# code_1007
source: Account inactive
vi: Tài khoản không tồn tại

# code_1008
source: Expired time OTP
vi: Thời gian OTP đã hết hạn

# code_1009
source: Email or password incorrect
vi: Email hoặc mật khẩu không chính xác

# code_1010
source: OTP incorrect
vi: OTP không chính xác

# code_1011
source: Password must have at least 8 characters, one capital letter and one special character
vi: Mật khẩu phải có ít nhất 8 ký tự, một chữ cái viết hoa và một ký tự đặc biệt

# code_1012
source: Category not found
vi: Không tìm thấy danh mục

# code_1013
source: Film not found
vi: Không tìm thấy phim

# code_1014
source: Room was existed in movie theater
vi: Phòng đã tồn tại trong rạp chiếu phim

# code_1015
source: Request has category name is empty
vi: Yêu cầu có tên danh mục trống

# code_1016
source: Information has not been completely filled in
vi: Thông tin chưa được điền đầy đủ

# code_1017
source: Duration is in 90 to 150 minute
vi: Thời lượng từ 90 đến 150 phút

# code_1018
source: Unauthenticated
vi: Chưa xác thực

# code_1019
source: Invalid date
vi: Ngày không hợp lệ

# code_1020
source: Number is not negative
vi: Số không được âm

# code_1021
source: Price is invalid
vi: Giá không hợp lệ

# code_1022
source: Email does not exist
vi: Email không tồn tại

# code_1023
source: Category name is duplicate
vi: Tên danh mục bị trùng

# code_1024
source: Film title is duplicate
vi: Tiêu đề phim bị trùng

# code_1025
source: Seat was ordered
vi: Ghế đã được đặt

# code_1026
source: Voucher was not enough
vi: Voucher không đủ

# code_1027
source: Seat was not ordered
vi: Ghế chưa được đặt

# code_1028
source: Account does not exist
vi: Tài khoản không tồn tại

# code_1029
source: Showtime is coming soon, please choose another showtime
vi: Suất chiếu sắp diễn ra, vui lòng chọn suất chiếu khác

# code_1030
source: Order not found
vi: Không tìm thấy đơn hàng

# code_1031
source: Food not found
vi: Không tìm thấy món ăn

# code_1032
source: The order does not belong to the account
vi: Đơn hàng không thuộc về tài khoản

# code_1033
source: You cannot rate and provide feedback
vi: Bạn không thể đánh giá và phản hồi

# code_1034
source: You have already rated and provided feedback
vi: Bạn đã đánh giá và phản hồi

# code_1035
source: Please enter complete information
vi: Vui lòng nhập đầy đủ thông tin

# code_1036
source: New password must be different from the old password
vi: Mật khẩu mới phải khác mật khẩu cũ

# code_1037
source: Start time is not today
vi: Thời gian bắt đầu không phải hôm nay

# code_1038
source: Room not found
vi: Không tìm thấy phòng

# code_1039
source: Movie schedule not found
vi: Không tìm thấy lịch chiếu phim

# code_1040
source: The movie has not been released yet
vi: Phim chưa được phát hành

# code_1041
source: Date's schedule must be after now 7 days
vi: Lịch chiếu phải sau thời điểm hiện tại 7 ngày

# code_1042
source: Order was used or expired
vi: Đơn hàng đã được sử dụng hoặc hết hạn

# code_1043
source: You can only book a maximum of 10 seats
vi: Bạn chỉ có thể đặt tối đa 10 ghế

# code_1044
source: Voucher not found
vi: Không tìm thấy voucher

# code_1045
source: String seat format is incorrect
vi: Định dạng chuỗi ghế không chính xác

# update_success
source: Update successfully
vi: Cập nhật thông tin thành công

# otp_send
source: An OTP was send in your email
vi: Một OTP đã được gửi vào email của bạn

# otp_digit
source: Please enter a 6-digit OTP
vi: Vui lòng nhập OTP 6 chữ số

# no_internet
source: No network connection. Please check your internet
vi: Không có kết nối mạng. Vui lòng kiểm tra internet của bạn

# error_message
source: An unexpected error occurred. Please try again
vi: Ơ! Đã xảy ra lỗi. Vui lòng thử lại sau

# rating_success
source: Rating feedBack successful! Thanks you
vi: Phản hồi đánh giá thành công! Cảm ơn bạn

# sign_up_success
source: Sign up successful
vi: Đăng ký thành công

# active_success
source: Activation successful
vi: Kích hoạt thành công

# valid_email
source: Please enter a valid email
vi: Vui lòng nhập email hợp lệ

# valid_password
source: Please enter a valid password
vi: Vui lòng nhập mật khẩu hợp lệ

# nothing_changes
source: Nothing has changed
vi: Thông tin không có gì thay đổi

# review_movie
source: What do you think about the movie?
vi: Bạn nghĩ gì về bộ phim này?

# comment_movie
source: Comment
vi: Ý kiến của bạn
